lkolbly/cmsis-svd/data/TexasInstruments/LM3S5951.svd
        <register>
          <name>RXTYPE11</name>
          <description>USB Host Configure Receive Type Endpoint 11</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE11_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE11_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE11_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE11_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE11_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE11_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE11_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE11_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE11_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE11_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL11</name>
          <description>USB Host Receive Polling Interval Endpoint 11</description>
          <addressOffset>0x000001BD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL11_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL11</name>
          <description>USB Host Receive Polling Interval Endpoint 11</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001BD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL11_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP12</name>
          <description>USB Maximum Transmit Data Endpoint 12</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP12_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL12</name>
          <description>USB Transmit Control and Status Endpoint 12 Low</description>
          <addressOffset>0x000001C2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL12_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL12</name>
          <description>USB Transmit Control and Status Endpoint 12 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001C2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL12_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL12_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH12</name>
          <description>USB Transmit Control and Status Endpoint 12 High</description>
          <addressOffset>0x000001C3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH12_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH12_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP12</name>
          <description>USB Maximum Receive Data Endpoint 12</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP12_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL12</name>
          <description>USB Receive Control and Status Endpoint 12 Low</description>
          <addressOffset>0x000001C6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL12_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL12</name>
          <description>USB Receive Control and Status Endpoint 12 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001C6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL12_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL12_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH12</name>
          <description>USB Receive Control and Status Endpoint 12 High</description>
          <addressOffset>0x000001C7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH12_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH12</name>
          <description>USB Receive Control and Status Endpoint 12 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001C7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH12_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH12_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT12</name>
          <description>USB Receive Byte Count Endpoint 12</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT12_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE12</name>
          <description>USB Host Transmit Configure Type Endpoint 12</description>
          <addressOffset>0x000001CA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE12_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE12_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE12_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL12</name>
          <description>USB Host Transmit Interval Endpoint 12</description>
          <addressOffset>0x000001CB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL12_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL12</name>
          <description>USB Host Transmit Interval Endpoint 12</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001CB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL12_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE12</name>
          <description>USB Host Configure Receive Type Endpoint 12</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE12_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE12_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE12_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL12</name>
          <description>USB Host Receive Polling Interval Endpoint 12</description>
          <addressOffset>0x000001CD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL12_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL12</name>
          <description>USB Host Receive Polling Interval Endpoint 12</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001CD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL12_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP13</name>
          <description>USB Maximum Transmit Data Endpoint 13</description>
          <addressOffset>0x000001D0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP13_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL13</name>
          <description>USB Transmit Control and Status Endpoint 13 Low</description>
          <addressOffset>0x000001D2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL13_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL13</name>
          <description>USB Transmit Control and Status Endpoint 13 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001D2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL13_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL13_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
